# Item Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArray..::..Item Property
CurveArray Class See Also
---
Gets or sets a curve at a specified index within the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Curve this[
	int index
] { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Item ( _
	index As Integer _
) As Curve
	Get
	Set
```

Visual C++
---
```text
public:
virtual property Curve^ Item[int index] {
	Curve^ get (int index);
	void set (int index, Curve^ value);
}
```

# ### Parameters
index
    Type: System..::..Int32The index of the curve to be set or retrieved.
# ### Return Value
Returns the curve at the specified index.
# See Also
CurveArray Class
Autodesk.Revit.DB Namespace